brew "glib"
brew "openjdk"
brew "autoconf"
brew "libtool"
brew "autogen"
brew "automake"
brew "openjdk@21"
brew "bazel"
brew "beancount"
brew "bison"
brew "buildifier"
brew "clang-format"
brew "cmake"
brew "dotnet"
brew "duckdb"
brew "exiftool"
brew "fava"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fswatch"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "graphviz"
brew "hledger"
brew "htop"
brew "hugo"
brew "python@3.12"
brew "imagemagick"
brew "jj"
brew "jq"
brew "llm"
brew "lsof"
brew "mercurial"
brew "mtr"
brew "nmap"
brew "node"
brew "numpy"
brew "openjdk@11"
brew "pandoc"
brew "pkgconf"
brew "pillow"
brew "pstree"
brew "pv"
brew "python-setuptools"
brew "python@3.10"
brew "python@3.11"
brew "qt@5"
brew "rclone"
brew "restic"
brew "ruby"
brew "tcping"
brew "tig"
brew "tmux"
brew "tree"
brew "uv"
brew "wakeonlan"
brew "watch"
brew "wget"
cask "1password-cli"
cask "ghostty"
cask "kitty"
cask "transmission"
cask "wezterm"
vscode "acarreiro.calculate"
vscode "bazelbuild.vscode-bazel"
vscode "coolbear.systemd-unit-file"
vscode "eamodio.gitlens"
vscode "faustinoaq.lex-flex-yacc-bison"
vscode "flowtype.flow-for-vscode"
vscode "gerane.theme-wombat"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "joaompinto.vscode-graphviz"
vscode "justusadam.language-haskell"
vscode "kalitaalexey.vscode-rust"
vscode "kurre.turndown-vscode"
vscode "lencerf.beancount"
vscode "luggage66.awk"
vscode "maelvalais.autoconf"
vscode "mark-hansen.hledger-vscode"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-serial-monitor"
vscode "nickdemayo.vscode-json-editor"
vscode "orta.vscode-jest"
vscode "platformio.platformio-ide"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "skyapps.fish-vscode"
vscode "teddydd.fish"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "zainchen.json"
vscode "zxh404.vscode-proto3"
